Revit 2027 API
MEPHiddenLineSettings.DrawHiddenLine Property
 Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DrawHiddenLine { get; set; }
Public Property DrawHiddenLine As Boolean
	Get
	Set
public:
property bool DrawHiddenLine {
	bool get ();
	void set (bool value);
}
member DrawHiddenLine : bool with get, set
Property Value
Boolean
See Also
Reference
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace